#+TITLE:
#+LANGUAGE:  en
#+OPTIONS: H:5 author:nil email:nil creator:nil timestamp:nil skip:nil toc:nil
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_CLASS: acm-proc-article-sp
** General purpose lists

This source code block takes a one-column table and a command name and
outputs a LaTeX code block with the table contents as a comma
separated list wrapped by the command.

#+name: list-to-cs-string
#+header: :var in-list=term-list
#+header: :eval noexport
#+header: :var in-command="terms"
#+header: :results latex 
#+header: :exports results
#+BEGIN_SRC emacs-lisp
(defun list-to-comma (the-list)
  (let (
        (return-string "")
        )
    (while (> (length the-list) 0)
      (if (> (length return-string) 0)
          (setq return-string (concat return-string ", " (car (car the-list))))
        (setq return-string (car (car the-list)))  ;; else
        )
      (setq the-list (cdr the-list))
      ) ;; end of "while"
    return-string
    ) ;; end of "let"
    )
(let (
    (a (cdr (cdr in-list)))
)
(concat (format "\\%s{" in-command) (list-to-comma a) "}")
)
#+END_SRC

#+RESULTS: list-to-cs-string
#+BEGIN_LaTeX
\terms{Theory}
#+END_LaTeX

